cask_args appdir: "/Applications"

brew "gh"
brew "jq"
brew "mas"
brew "mysql-client"
brew "tcptraceroute"
brew "terminal-notifier"
brew "tfenv"
brew "tmux"
brew "tree"
brew "ripgrep"
brew "neovim"
brew "prettier"
brew "mas"
brew "php"
brew "php@7.4"
brew "php@8.0"
brew "python@3.8"
brew "python@3.10"
brew "typescript"
brew "zinit"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "exa"
brew "bat"
brew "peco"
brew "docker-compose"
brew "nvm"
brew "yarn"
brew "composer"
brew "golangci-lint"
brew "mockery"
brew "gomodifytags"
brew "grc"
brew "act"
brew "watchman"
brew "hyper"
brew "direnv"
brew "luarocks"
brew "dnsmasq"
brew "dive"
brew "docker-slim"
brew "silicon"
brew "mold"
brew "fd"
brew "gnupg"
brew "hyperfine"
brew "protobuf"
brew "cmake"
brew "wget"
brew "fvm"
brew "neofetch"
brew "yt-dlp"
brew "lnav"
brew "bottom"
brew "dust"
brew "procs"
brew "zllij"
brew "pyenv"
brew "go-task/tap/go-task"
brew "rye"
brew "neo4j"
brew "openjdk@17"
brew "maven"

# Go
brew "gopls"
brew "go@1.18"

cask "appcleaner"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "mysqlworkbench"
cask "visual-studio-code"
cask "dbeaver-community"
cask "dash"
cask "anki"
cask "ngrok"
cask "neovide"
cask "hammerspoon"
cask "dbeaver-community"
cask "discord"
cask "slack"
cask "kindle"
cask "deepl"
cask "dropbox"
cask "google-cloud-sdk"
cask "figma"
cask "microsoft-edge"
cask "zoom"
cask "krisp"
cask "steam"
cask "devtoys"
cask "1password"
cask "keep"
cask "vrew"
cask "telegram"
cask "rectangle"
cask "alacritty"
cask "spotify"
cask "vivaldi"
cask "betterdummy"
cask "betterdisplay"
cask "miniforge"
cask "keycastr"
cask "diffusionbee"
cask "gulp"
cask "google-cloud-sdk"
cask "telegram"
cask "cursor"
cask "android-studio"
cask "karabiner-elements"
cask "freetube"
cask "orbstack"
cask "via"
cask "brew"
cask "steam"
cask "raspberry-pi-imager"
cask "insomnia"
cask "superproductivity"
cask "cursor"
cask "alacritty"
cask "ghostty"
cask "microsoft-teams"
cask "kap"
cask "zap"

# WezTerm
tap "wez/wezterm"
cask "wez/wezterm/wezterm"

tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"

mas 'Dashlane', id: 517914548
mas 'Line', id: 539883307
mas 'HotspotShield VPN - Wifi Proxy', id: 771076721
mas 'xcode', id: 497799835
