cask_args appdir: "/Applications"

brew "gh"
brew "jq"
brew "mas"
brew "mysql-client"
brew "tcptraceroute"
brew "terminal-notifier"
brew "tfenv"
brew "tmux"
brew "tree"
brew "ripgrep"
brew "neovim"
brew "prettier"
brew "php"
brew "typescript"
brew "zinit"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "bat"
brew "peco"
brew "docker-compose"
brew "nvm"
brew "yarn"
brew "composer"
brew "golangci-lint"
brew "mockery"
brew "gomodifytags"
brew "grc"
brew "act"
brew "watchman"
brew "direnv"
brew "luarocks"
brew "dnsmasq"
brew "dive"
brew "docker-slim"
brew "silicon"
brew "mold"
brew "fd"
brew "gnupg"
brew "hyperfine"
brew "protobuf"
brew "cmake"
brew "wget"
brew "neofetch"
brew "yt-dlp"
brew "lnav"
brew "bottom"
brew "dust"
brew "procs"
brew "zellij"
brew "pyenv"
brew "go-task/tap/go-task"
brew "rye"
brew "neo4j"
brew "openjdk@17"
brew "maven"
brew "azure-cli"
brew "poppler"
brew "gcc"
brew "uv"
brew "chafa"
brew "just"
brew "eza"
brew "aicommits"
brew "yq"
brew "pre-commit"
brew "glow"
brew "efm-langserver"
brew "pyright"
brew "astro"

# Go
brew "gopls"

cask "appcleaner"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "mysqlworkbench"
cask "visual-studio-code"
cask "dbeaver-community"
cask "anki"
cask "ngrok"
cask "hammerspoon"
cask "dbeaver-community"
cask "discord"
cask "slack"
cask "dropbox"
cask "figma"
cask "microsoft-edge"
cask "zoom"
cask "krisp"
cask "steam"
cask "devtoys"
cask "vrew"
cask "rectangle"
cask "spotify"
cask "miniforge"
cask "keycastr"
cask "diffusionbee"
cask "gcloud-cli"
cask "telegram"
cask "cursor"
cask "android-studio"
cask "karabiner-elements"
cask "orbstack"
cask "via"
cask "steam"
cask "raspberry-pi-imager"
cask "insomnia"
cask "super-productivity"
cask "cursor"
cask "alacritty"
cask "ghostty"
cask "microsoft-teams"
cask "kap"
cask "zap"
cask "wechat"
cask "obsidian"
cask "windsurf"
cask "gyazo"
cask "chromium"
cask "freetube"
cask "claude-code"
cask "font-hackgen-nerd"
cask "font-noto-sans"
cask "font-noto-nerd-font"
cask "cyberghost-vpn"
cask "google-drive"
cask "font-0xproto-nerd-font"
cask "font-go-mono-nerd-font"
cask "chatgpt-atlas"
cask "codex"
cask "antigravity"
cask "aqua-voice"

# WezTerm
tap "wez/wezterm"
cask "wez/wezterm/wezterm"

# Bun
tap "oven-sh/bun"
brew "bun"

# Poe
tap "nat-n/poethepoet"
brew "nat-n/poethepoet/poethepoet"

mas 'Dashlane', id: 517914548
mas 'Line', id: 539883307
mas 'HotspotShield VPN - Wifi Proxy', id: 771076721
mas 'xcode', id: 497799835
